// const start = document.querySelector('.start');
// const stop = document.querySelector('.stop');
// const h1 = document.querySelector('.h1');
// const ruin = document.querySelector('.ruin');

// let counter = 0;
// let time;

// function startTimer() {
//   time = setInterval(timer, 1000);
// }

// function stopTimer() {
//   clearInterval(time);
// }

// function ruinTimer() {
//   for(let i = 0; i < 1000000000; ++i) {

//   }
// }

// start.addEventListener('click', startTimer);
// stop.addEventListener('click', stopTimer);
// ruin.addEventListener('click', ruinTimer);


// function timer() {
//   h1.textContent = ++counter;
// }

// const list = document.querySelector('.list');
// const input = document.querySelector('.input-text');

// let textArray = `Анатомия и физиология
// Внешние покровы
// Внешние покровы рыб представлены кожей с чешуёй (у некоторых рыб чешуя отсутствует). Как и у всех других позвоночных, кожа рыб делится на дерму и эпидермис (верхний слой кожи эктодермального происхождения, состоящий из эпителиальной ткани). Эпидермис у рыб неороговевающий. Железы в эпидермисе вырабатывают мукусоподобный секрет (слизь), который защищает внешние покровы животного.

// В формировании чешуи основную роль играет внутренний слой кожи — дерма. Хрящевые рыбы имеют плакоидную чешую, которая гомологична зубам всех позвоночных; перемещаясь в ходе эволюции на челюсти, плакоидные чешуи, собственно, и превращаются в зубы у акул и скатов. Плакоидная чешуя состоит из дентина, который формирует основу чешуй, а сверху покрыта эмалью. По химическому составу дентин и эмаль акул схожи с дентином и эмалью зубов человека. Утраченные плакоидные чешуи не возобновляются, но при росте рыбы их количество увеличивается. Плавниковые шипы некоторых хрящевых рыб (например, у черноморского катрана) тоже являются преобразованными плакоидными чешуями.

// Костистым рыбам присуще несколько разных типов чешуи.


// Чешуя костных рыб
// Ганоидная чешуя имеется у наиболее примитивных из лучепёрых рыб, например осетровых. Она сформирована костяными пластинками, которые сверху покрыты пластом похожего на дентин вещества — ганоина; часто такая чешуя покрывает тело рыбы сплошным защитным панцирем, как у представителей семейств Polypteridae и Lepisosteidae.

// Для ископаемых и современных кистеперых и двоякодышащих рыб характерна космоидная чешуя, внешняя поверхность которой образована пластом космина (откуда происходит название), а сверх него — дентина. Космин подстилается пластом губчатой кости. У современных видов кистепёрых и двоякодышащих рыб внешний дентиновый и внутренний губчатый пласты постепенно редуцируются: у современных видов рода Латимерия на поверхности чешуи сохранились лишь одиночные бугорки дентина.

// Окраска рыб может варьировать в очень широких пределах: от однотонной практически всех возможных цветов до маскировочной «камуфляжной» или, наоборот, подчеркнуто яркой «предупреждающей».

// Скелет и мышечная система
// Опорно-двигательная система рыб — система органов и тканей рыб, которая позволяет им изменять своё положение в окружающей среде и осуществлять движение. Части опорно-двигательной системы, благодаря эволюционным видоизменениям, приспособлены также и для выполнения других специализированных функций.

// В отличие от наземных позвоночных, череп которых состоит из сращённых костей, более чем 40 костных элементов черепа рыб могут двигаться независимо. Это позволяет вытягивать челюсти, раздвигать их в стороны, опускать жаберный аппарат и дно ротовой полости.

// Подвижные элементы крепятся к более жёстко сочленённому нейрокраниуму, который окружает головной мозг. Нейрокраниум костных рыб в эволюции возникает из хрящевого черепа хрящевых рыб, к которому прирастают кожные костные пластинки.


// Мурены обладают двумя парами челюстей. Вторая пара, называемая глоточной, или фарингеальной, находится позади черепа. Хотя внутренние челюсти не выходят за пределы внешних, они помогают более крепко ухватить добычу
// Челюсти в классах костных и хрящевых рыб эволюционно образовались из третьей пары жаберных дуг (о чём свидетельствуют рудименты первых двух пар дуг у акул — так называемые губные хрящи).

// У костистых рыб челюсти несут основные группы зубов на переднечелюстной (premaxilla) и верхнечелюстной костях (maxilla, верхняя челюсть»), на dentale и articulare (нижняя челюсть).

// Несколько специализированных групп костей формируют дно ротовой полости и соединяют челюсти с другими элементами черепа. Наиболее рострально (впереди) расположена гиоидная дуга, которая играет важную роль при изменении объёма ротовой полости. За ней идут жаберные дуги, которые несут жаберные дыхательные структуры, и наиболее каудально расположены так называемые глоточные челюсти, которые также могут нести зубы.

// Во время питания мышцы, которые опускают комплекс нижней челюсти, смещают этот комплекс таким образом, что челюсти выдвигаются вперед. При этом в ротовой полости создаётся всасывающая сила за счёт опускания дна рта. Жаберные крышки при этом закрывают жабры. Такая комбинация движений приводит к всасыванию воды и втягиванию пищи в рот.


// Виды хвостовых плавников рыб. (A) — гетероцеркальный, (B) — протоцеркальный, (C) — гомоцеркальный, (D) — дифицеркальный
// Движущая сила при плавании рыб создаётся плавниками: парными (грудные и брюшные) и непарными (спинной, анальный, хвостовой). При этом у костных рыб плавники состоят из костных (у некоторых примитивных — из хрящевых) лучей, соединённых перепонкой. Присоединённые к основным лучам мышцы могут разворачивать или свёртывать плавник, изменять его ориентацию или генерировать волнообразные движения. Хвостовой плавник, который у большинства рыб является основным движителем, поддерживается набором специальных сплюснутых костей (уростиль и др.) и ассоциированных с ними мышц в дополнение к боковым мышцам туловища. По соотношению размеров верхней и нижней лопасти хвостовой плавник может быть гомоцеркальным (когда обе лопасти имеют равную величину; это характерно для большинства лучепёрых рыб) или гетероцеркальным (когда одна лопасть, обычно верхняя, больше другой; характерно для акул и скатов, а также осетровых; у таких представителей костных рыб как меченосцы хвостовой плавник гетероцеркальный с большей нижней лопастью).

// Позвоночник рыб состоит из отдельных, несращённых позвонков. Позвонки рыб амфицельные (то есть обе их торцевые поверхности вогнутые), между позвонками находится хрящевая прослойка; невральные дуги, расположенные сверху над телами позвонков, формируют позвоночный канал, защищающий спинной мозг. Позвоночник делится на два отдела: туловищный и хвостовой. От позвонков туловища в стороны отходят рёберные отростки, к которым крепятся рёбра. В хвостовом отделе позвоночника боковых отростков нет, зато кроме невральной дуги имеется сосудистая (гемальная) дуга, которая прикрепляется к позвонку снизу и защищает проходящий в ней большой кровеносный сосуд — брюшную аорту. От невральных и гемальных дуг вертикально вверх и вниз отходят заострённые остистые отростки.

// Плавники
// Плавники рыб служат главным образом основными движителями для активного плавания, а также для стабилизации положения и маневрирования в толще воды и даже для опоры и хождения по грунту. В процессе эволюции строение плавников у некоторых рыб изменилось для выполнения иных жизненных функций. Например брюшные плавники или анальный плавник либо их отдельные лучи или части могут быть преобразованы в особые копулятивные органы, служащие для внутреннего оплодотворения. Первый луч спинного плавника у некоторых глубоководных рыб-хищников может быть превращён в своеобразное удилище — илиций, служащее для приманивания потенциальных жертв. Различают парные и непарные плавники.

// К непарным плавникам относятся: спинной плавник (лат. pinna dorsalis, обозначается заглавной латинской буквой D), который может быть представлен у разных рыб числом от одного до трёх, крайне редко отсутствует вовсе; анальный, или подхвостовой, плавник (лат. pinna analis, обозначается буквой A), может быть у разных рыб в количестве от одного до двух, изредка отсутствует вовсе; хвостовой плавник (лат. pinna caudalis, обозначается буквой C) у некоторых рыб отсутствует; жировой плавник (лат. pinna adiposa), встречающийся у некоторых групп рыб.

// Парные плавники, по сути, представляют собой парные конечности, опирающиеся на соответствующие им внутренние скелетные элементы — пояса плавников. У подавляющего большинства рыб представлены двумя парами плавников: грудным плавником (лат. pinna pectoralis, обозначается латинской буквой P) и брюшным плавником (лат. pinna ventralis, обозначается заглавной латинской буквой V). У некоторых рыб могут отсутствовать брюшные, а в редких случаях — и грудные плавники. По положению на туловище обычно различают 3 основных типа брюшных плавников: абдоминальные — расположены в средней части тела позади грудных плавников, торакальные — расположены под грудными плавниками, и югулярные — расположены впереди грудных плавников на горле.

// Мышцы
// В правую и левую стороны от позвоночника отходит мембрана из соединительной ткани, которая называется горизонтальной септой (перегородкой) и разделяет мышцы тела рыбы, называемые миомерами, на дорсальную (верхнюю) и вентральную (нижнюю) части.

// Плавание рыб осуществляется благодаря сокращению мышц, которые соединяются сухожилиями с позвоночником. Миомеры в теле рыбы имеют форму конусов, вложенных один в другой, и разделённых перегородками соединительной ткани (миосептами). Сокращение миомеров через сухожилие передаётся на позвоночник, побуждая его к волнообразному движению (ундуляции) по всей длине тела или лишь в хвостовом его отделе.

// В целом мускулатура рыб представлена двумя типами мышц. «Медленные» мышцы используются при спокойном плавании. Они содержат много миоглобина, который обуславливает их красный цвет. Метаболизм в них в основном аэробный, то есть в них происходит полное окисление питательных веществ. Такие красные мышцы могут долго не утомляться и потому используются при долгом монотонном плавании. В отличие от красных, «быстрые» белые мышцы с преимущественно гликолитиновым метаболизмом способны к быстрому, но кратковременному сокращению. Они используются при быстрых внезапных рывках; при этом они могут давать большую, чем красные мышцы, мощность, но быстро утомляются.

// У многих рыб мышцы могут выполнять также и некоторые другие функции кроме движения. У некоторых видов они участвуют в терморегуляции (термогенезе). У тунцов (Scombridae) благодаря активности мускулатуры температура мозга поддерживается на более высоком уровне, чем температура других частей тела, когда тунцы охотятся на кальмаров в глубоких холодных водах.

// Электрические токи, которые генерируются при сокращении мышц, используются слонорылом как коммуникационный сигнал; у электрических скатов электрические импульсы, генерированные видоизменёнными мышцами, используются для поражения других животных. Модификация мышечных клеток для выполнения функции электрической батареи эволюционно происходила независимо и неоднократно в разных таксонах: глазных мышц у рыб-звездочётов (Uranoscopidae), жевательной мускулатуры (электрические скаты) или осевой мускулатуры (электрические угри).`.split(' ');

// let timer = null;

// function renderList(array) {
//   list.innerHTML = '';
//   array.forEach((item) => {
//     list.innerHTML += `
//       <li>${item}</li>
//     `;
//   });
// }

// function filterList(event) {
//   if (!input.value) {
//     renderList(textArray);
//   } else {
//     renderList(textArray.filter((item) => item.toLowerCase().includes(input.value.toLowerCase())));
//   }
// }

// input.addEventListener('input', () => {
//   if (timer) {
//     clearTimeout(timer);
//     timer = null;
//   }
//   timer = setTimeout(filterList, 500);
// });

// renderList(textArray);

const button = document.querySelector('.joke');
const container = document.querySelector('.container');

const url = 'https://api.chucknorris.io/jokes/random';



function sendRequest() {
  const req = new XMLHttpRequest();
  req.open('GET', url);
  req.addEventListener('load', (event) => {
    const response = JSON.parse(event.currentTarget.response);
    container.textContent = response.value;
  });
  req.send();
}

button.addEventListener('click', sendRequest);

